app/views/customers/rooms/index.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    						<!--%= attachment_image_tag entry.user, :image, :fill, 50, 50, format:'jpeg', fallback: "no_image.jpeg", size:'50×50' %-->
    							<%= entry.customer.first_name %><%= entry.customer.last_name %>

SELECT  "direct_messages".* FROM "direct_messages" WHERE "direct_messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  						<td>
  							<% direct_message = DirectMessage.find_by(id: entry.room.direct_message_ids.last) %>