app/views/customers/rooms/show.html.erb

				<% if e.customer != current_customer %>
				  <h5 class="text-left <%= @class %>" id="<%= @class %>" style="font-size: 30px;" data-id="<%= e.customer.id %>"><%= link_to "@#{e.customer.first_name}", customers_customer_path(e.customer_id) %></h5>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]