app/channels/application_cable/connection.rb

    def find_verified_customer
      Customer.find(session['warden.user.customer.key'][0][0])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]