app/controllers/admin/blogs_controller.rb

  def index
  	@blog = Blog.all
    @blog = Blog.page(params[:page]).per(14)
---
SELECT  `blogs`.* FROM `blogs` LIMIT 14 OFFSET 0

  def show
  	@blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1

  def edit
  	@blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1

  def update
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1

  def destroy
      blog = Blog.find(params[:id])
      blog.destroy
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 1