app/controllers/admin/categories_controller.rb

  def destroy
    category = Category.find(params[:id])
    category.destroy
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 3