app/controllers/admin/discs_controller.rb

SELECT  `discs`.* FROM `discs` WHERE `discs`.`id` = 1 LIMIT 1
---
  def edit
    @disc = Disc.find(params[:id])

SELECT  `discs`.* FROM `discs` WHERE `discs`.`id` = 1 LIMIT 1
---
  def show
  	@disc = Disc.find(params[:id])

INSERT INTO `discs` (`image_id`, `name`, `price`, `release_date`, `created_at`, `updated_at`, `category_id`) VALUES ('f4388fec37d855bb3f540e8262bc8d5187306c6b87f8c1351db1828cf644', '僕の創世', 1000, '2020-01-15', '2020-01-29 14:50:19', '2020-01-29 14:50:19', 1)
---
  def create
  	@disc = Disc.new(disc_params)
    if @disc.save

SELECT  `discs`.* FROM `discs` WHERE `discs`.`id` = 1 LIMIT 1
UPDATE `discs` SET `image_id` = 'f4388fec37d855bb3f540e8262bc8d5187306c6b87f8c1351db1828cf644', `release_date` = '', `updated_at` = '2020-01-29 14:51:30' WHERE `discs`.`id` = 1
---
  def update
    @disc = Disc.find(params[:id])
    if @disc.update(disc_params)

SELECT  `discs`.* FROM `discs` WHERE `discs`.`id` = 3 LIMIT 1
DELETE FROM `discs` WHERE `discs`.`id` = 3
---
  def destroy
      disc = Disc.find(params[:id])
      disc.destroy