app/controllers/admin/homes_controller.rb

  def topic
    @information = Information.all
    @information = Information.page(params[:page]).per(4)
    @topics = Topic.all
    @topics = Topic.page(params[:page]).per(4)
---
SELECT  "information".* FROM "information" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM `information`
SELECT  "topics".* FROM "topics" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]

  def movie
  	@video = Video.all
    @video = Video.page(params[:page]).per(6)
  	@movie = Movie.all
    @movie = Movie.page(params[:page]).per(6)
---
SELECT  `videos`.* FROM `videos` LIMIT 6 OFFSET 0
SELECT  `movies`.* FROM `movies` LIMIT 6 OFFSET 0

  def music
  	@disc = Disc.all
    @disc = Disc.page(params[:page]).per(6)
  	@music = Music.all
    @music = Music.page(params[:page]).per(6)
    @category = Category.new
    @categories = Category.all
---
SELECT  `discs`.* FROM `discs` LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `discs`
SELECT  `musics`.* FROM `musics` LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `musics`
SELECT `categories`.* FROM `categories`

  def category
    @category = Category.find(params[:id])
    @discs = Disc.where(category_id: @category.id)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `discs`.* FROM `discs` WHERE `discs`.`category_id` = 1

  def live
    @live = Live.all
    @live = Live.page(params[:page]).per(14)
---
SELECT  "lives".* FROM "lives" LIMIT ? OFFSET ?  [["LIMIT", 14], ["OFFSET", 0]]