app/controllers/admin/informations_controller.rb

SELECT  `information`.* FROM `information` WHERE `information`.`id` = 3 LIMIT 1
---
  def edit
    @information = Information.find(params[:id])

SELECT  `information`.* FROM `information` WHERE `information`.`id` = 3 LIMIT 1
---
  def show
    @information = Information.find(params[:id])

INSERT INTO `information` (`title`, `details`, `created_at`, `updated_at`) VALUES ('1月27日発売「GiGS」3月号の表紙・巻頭特集にKing Gnuが登場！', '<p><span style=\"font-size: 13px;\">Your local changes to the following files would be overwritten by merge</span><br></p>', '2020-01-30 07:16:47', '2020-01-30 07:16:47')
---
  def create
  	@information = Information.new(information_params)
    if @information.save

SELECT  `information`.* FROM `information` WHERE `information`.`id` = 3 LIMIT 1
---
  def update
    @information = Information.find(params[:id])

SELECT  `information`.* FROM `information` WHERE `information`.`id` = 3 LIMIT 1
DELETE FROM `information` WHERE `information`.`id` = 3
---
  def destroy
      information = Information.find(params[:id])
      information.destroy