app/controllers/admin/lives_controller.rb

  def edit
    @live = Live.find(params[:id])
---
SELECT  `lives`.* FROM `lives` WHERE `lives`.`id` = 2 LIMIT 1

  def show
    @live = Live.find(params[:id])
---
SELECT  `lives`.* FROM `lives` WHERE `lives`.`id` = 2 LIMIT 1

  def create
  	@live = Live.new(live_params)

  		if @live.save
---
INSERT INTO "lives" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
     @live = Live.find(params[:id])
---
SELECT  `lives`.* FROM `lives` WHERE `lives`.`id` = 2 LIMIT 1

  def destroy
    live = Live.find(params[:id])
    live.destroy
---
SELECT  `lives`.* FROM `lives` WHERE `lives`.`id` = 2 LIMIT 1
DELETE FROM `lives` WHERE `lives`.`id` = 2