app/controllers/admin/movies_controller.rb

  def edit
    @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def show
  	@movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1

  def create
  	@movie = Movie.new(movie_params)
  	if @movie.save
---
INSERT INTO `movies` (`title`, `movie`, `created_at`, `updated_at`, `image_id`) VALUES ('不敗神話', 'joined_video_b64f00b2c16b4590861e54feb4e34e71.MP4', '2020-01-29 15:17:13', '2020-01-29 15:17:13', 'f76e9df160035f6cfcfa91245ed8c0a1388dc8074447078c31901b3a7339')

  def update
     @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
UPDATE `movies` SET `movie` = 'joined_video_b64f00b2c16b4590861e54feb4e34e71.MP4', `image_id` = '7ca4c3c32244b7aa3d9d2aa6aa6ff9b29a105d79666b262a3c6149b8e4b7', `updated_at` = '2020-01-29 15:19:42' WHERE `movies`.`id` = 1

  def destroy
    movie = Movie.find(params[:id])
    movie.destroy
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 1