app/controllers/admin/musics_controller.rb

SELECT  `musics`.* FROM `musics` WHERE `musics`.`id` = 1 LIMIT 1
---
  def edit
    @music = Music.find(params[:id])

SELECT  `musics`.* FROM `musics` WHERE `musics`.`id` = 1 LIMIT 1
---
  def show
  	@music = Music.find(params[:id])

INSERT INTO `musics` (`image_id`, `name`, `listening`, `comment`, `created_at`, `updated_at`) VALUES ('becfb675bef1e7bd99baa51bca1beda967cb78c7a85b8e55cff40403ecf0', '僕の創世', '夢は儚しされども要.m4a', '<p>おはよう</p>', '2020-01-29 15:07:15', '2020-01-29 15:07:15')
---
  def create
  	@music = Music.new(music_params)
  	if @music.save

SELECT  `musics`.* FROM `musics` WHERE `musics`.`id` = 1 LIMIT 1
UPDATE `musics` SET `listening` = '夢は儚しされども要__online-audio-converter.com_.wav', `image_id` = '162c0cc8ef8a59209add8df1eac71fdae6f44f1d13143c57bd585db172df', `updated_at` = '2020-01-29 15:02:15' WHERE `musics`.`id` = 1
---
  def update
    @music = Music.find(params[:id])
    if @music.update(music_params)

SELECT  `musics`.* FROM `musics` WHERE `musics`.`id` = 1 LIMIT 1
DELETE FROM `musics` WHERE `musics`.`id` = 1
---
  def destroy
      music = Music.find(params[:id])
      music.destroy