app/controllers/admin/topics_controller.rb

  def edit
    @topic = Topic.find(params[:id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1

  def show
    @topic = Topic.find(params[:id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1

  def create
  	@topic = Topic.new(topic_params)

  		if @topic.save
---
INSERT INTO `topics` (`title`, `details`, `created_at`, `updated_at`) VALUES ('BLUE ENCOUNT TOUR2020 ホールツアーのLINEチケット二次先行受付スタート！！', '<p>11111111<br></p>', '2020-01-30 06:45:00', '2020-01-30 06:45:00')

  def update
    @topic = Topic.find(params[:id])
    if @topic.update(topic_params)
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1
UPDATE `topics` SET `details` = '<p>11111111asasasasas<br></p>', `updated_at` = '2020-01-30 06:47:04' WHERE `topics`.`id` = 1

    def destroy
      topic = Topic.find(params[:id])
      topic.destroy
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1
DELETE FROM `topics` WHERE `topics`.`id` = 1