app/controllers/admin/videos_controller.rb

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1
---
  def show
  	@video = Video.find(params[:id])

INSERT INTO `videos` (`title`, `video`, `created_at`, `updated_at`, `image_id`) VALUES ('僕の創世', 'joined_video_b64f00b2c16b4590861e54feb4e34e71.MP4', '2020-01-30 06:48:10', '2020-01-30 06:48:10', '0f615a77a776cd121ccac4a1035680de812ba99985e1657c6eb6ce47d320')
---
  def create
  	@video = Video.new(video_params)
  	if @video.save

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1
DELETE FROM `videos` WHERE `videos`.`id` = 1
---
  def destroy
    video = Video.find(params[:id])
    video.destroy