app/controllers/customers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
  	@blog = Blog.all