app/controllers/customers/customers_controller.rb

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 ORDER BY `customers`.`id` ASC LIMIT 1
---
  def edit
  	@customer = Customer.find(params[:id])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."customer_id" = ?  [["customer_id", 2]]
---
  def show
  	@customer = Customer.find(params[:id])
    @currentCustomerEntry = Entry.where(customer_id: current_customer.id)
    @customerEntry=Entry.where(customer_id: @customer.id)
    unless @customer.id == current_customer.id
      @currentCustomerEntry.each do |cu|

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `address` = 'aaaaaa', `updated_at` = '2020-01-29 15:28:09' WHERE `customers`.`id` = 1
---
  def update
  	@customer = Customer.find(params[:id])
    @customer.update(customer_params)

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `is_deleted` = TRUE, `updated_at` = '2020-01-29 15:28:26' WHERE `customers`.`id` = 1
---
  def hide
  	@customer = Customer.find(params[:id])
    @customer.update(is_deleted: true)