app/controllers/customers/discs_controller.rb

SELECT `discs`.* FROM `discs`
SELECT `categories`.* FROM `categories`
---
  def index
  	@disc = Disc.all
  	@categories = Category.all

SELECT  `discs`.* FROM `discs` WHERE `discs`.`id` = 7 LIMIT 1
---
  def show
  	@disc = Disc.find(params[:id])