app/controllers/customers/homes_controller.rb

SELECT  "information".* FROM "information" ORDER BY "information"."created_at" DESC LIMIT ?  [["LIMIT", 3]]
SELECT  "lives".* FROM "lives" ORDER BY "lives"."created_at" DESC LIMIT ?  [["LIMIT", 3]]
SELECT  "videos".* FROM "videos" ORDER BY "videos"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def top_second
  	@information = Information.all.order(created_at: :desc).limit(3)
  	@live = Live.all.order(created_at: :desc).limit(3)
  	@video = Video.all.order(created_at: :desc).limit(1)

SELECT  `topics`.* FROM `topics` ORDER BY `topics`.`created_at` DESC LIMIT 3
SELECT  `movies`.* FROM `movies` ORDER BY `movies`.`created_at` DESC LIMIT 1
SELECT  `blogs`.* FROM `blogs` ORDER BY `blogs`.`created_at` DESC LIMIT 3
---
  def top_third
  	@topics = Topic.all.order(created_at: :desc).limit(3)
  	@movie = Movie.all.order(created_at: :desc).limit(1)
  	@blog = Blog.all.order(created_at: :desc).limit(3)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT `discs`.* FROM `discs` WHERE `discs`.`category_id` = 1
---
  def category
    @category = Category.find(params[:id])
    @discs = Disc.where(category_id: @category.id)