app/controllers/customers/informations_controller.rb

SELECT `information`.* FROM `information`
---
  def index
  	@information = Information.all