app/controllers/customers/lives_controller.rb

SELECT `lives`.* FROM `lives`
---
  def index
  	@live = Live.all