app/controllers/customers/movies_controller.rb

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 2 LIMIT 1
---
  def show
  	@movie = Movie.find(params[:id])

SELECT `movies`.* FROM `movies`
---
  def index
  	@movie = Movie.all