app/controllers/customers/musics_controller.rb

SELECT  `musics`.* FROM `musics` WHERE `musics`.`id` = 4 LIMIT 1
---
  def show
  	@music = Music.find(params[:id])

SELECT `musics`.* FROM `musics`
---
  def index
  	@music = Music.all