app/controllers/customers/rooms_controller.rb

  def index
    @customer = current_customer
    @currentEntries = current_customer.entries
    myRoomIds = []
    @currentEntries.each do |entry|
---
SELECT "entries".* FROM "entries" WHERE "entries"."customer_id" = ?  [["customer_id", 2]]

  def show
    @room = Room.find(params[:id])
    #present?の戻り値は真偽値。よって、trueの場合、
    if Entry.where(:customer_id => current_customer.id, :room_id => @room.id).present?
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."customer_id" = ? AND "entries"."room_id" = ?  [["customer_id", 2], ["room_id", 1]]

  def create
    @room = Room.create(:name => "DM")
    @entry1 = Entry.create(:room_id => @room.id, :customer_id => current_customer.id)
    @entry2 = Entry.create(params.require(:room).permit(:customer_id).merge(:room_id => @room.id))
---
INSERT INTO "rooms" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2020-01-30 11:58:19.570420"], ["updated_at", "2020-01-30 11:58:19.570420"], ["name", "DM"]]
INSERT INTO "entries" ("customer_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 2], ["room_id", 1], ["created_at", "2020-01-30 11:58:19.789890"], ["updated_at", "2020-01-30 11:58:19.789890"]]
INSERT INTO "entries" ("customer_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 1], ["room_id", 1], ["created_at", "2020-01-30 11:58:19.827032"], ["updated_at", "2020-01-30 11:58:19.827032"]]