app/controllers/customers/topics_controller.rb

  def show
  	@topic = Topic.find(params[:id])
---
SELECT  `topics`.* FROM `topics` WHERE `topics`.`id` = 2 LIMIT 1