app/controllers/customers/videos_controller.rb

  def index
  	@video = Video.all
---
SELECT `videos`.* FROM `videos`