app/views/admin/homes/music.html.erb

            <%= link_to "/admin/category/#{category.id}" do %>
	        <%= category.name %>(<%= category.discs.count %>)
---
SELECT COUNT(*) FROM `discs` WHERE `discs`.`category_id` = 1