app/channels/room_channel.rb

  def speak(data)
    DirectMessage.create! message: data['direct_message'], customer_id: current_customer.id, room_id: params['room']
---
INSERT INTO "direct_messages" ("customer_id", "room_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 2], ["room_id", 1], ["message", "sasasa"], ["created_at", "2020-01-30 11:58:25.805769"], ["updated_at", "2020-01-30 11:58:25.805769"]]