app/views/customers/direct_messages/_direct_message.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	<!--%= attachment_image_tag direct_message.user, :profile_image, fallback: "no_image.jpg", class:"profile-img-circle", size: "40x40" %-->
	<%= direct_message.customer.first_name %><%= direct_message.customer.last_name %>

INSERT INTO `direct_messages` (`customer_id`, `room_id`, `message`, `created_at`, `updated_at`) VALUES (3, 1, 'sasasa', '2020-01-30 02:35:21', '2020-01-30 02:35:21')
---
		<%= direct_message.message %><br>
		<h7 style="color: #C0C0C0;"><%= direct_message.created_at.strftime("%Y-%m-%d %H:%M") %></h7>