app/views/admin/discs/show.html.erb

SELECT `disks`.* FROM `disks` WHERE `disks`.`disc_id` = 1
SELECT `songs`.* FROM `songs` WHERE `songs`.`disk_id` = 1
---
						<div class ="disk">
							<% @disc.disks.each do |disk| %>
								<p>ディスク<%= disk.disk_order %><br>
									<% disk.songs.each do |song| %>