app/views/customers/discs/index.html.erb

SELECT COUNT(*) FROM `discs` WHERE `discs`.`category_id` = 1
SELECT "discs".* FROM "discs"
---
	<%= link_to "/customers/category/#{category.id}" do %>
				 			<h3 style="color: black; font-size: 15px; "><%= category.name %>(<%= category.discs.count %>)</h3>