app/views/customers/discs/show.html.erb

						<div class ="disk">
							<% @disc.disks.each do |disk| %>
								<p>ディスク<%= disk.disk_order %><br>
									<% disk.songs.each do |song| %>
---
SELECT `disks`.* FROM `disks` WHERE `disks`.`disc_id` = 7
SELECT `songs`.* FROM `songs` WHERE `songs`.`disk_id` = 9